coocox/Mplib/Toshaba/TMPM33x/TMPM330/cmsis_lib/lib/include/tmpm330_cec.h
    typedef enum {
        CEC_CYCLE_MAX_0 = 0,    /*!< 2.75ms */
        CEC_CYCLE_MAX_1 = 1,    /*!< 2.75ms+1cycles */
        CEC_CYCLE_MAX_2 = 2,    /*!< 2.75ms+2cycles */
        CEC_CYCLE_MAX_3 = 3,    /*!< 2.75ms+3cycles */
        CEC_CYCLE_MAX_4 = 4,    /*!< 2.75ms-1cycles */
        CEC_CYCLE_MAX_5 = 5,    /*!< 2.75ms-2cycles */
        CEC_CYCLE_MAX_6 = 6,    /*!< 2.75ms-3cycles */
        CEC_CYCLE_MAX_7 = 7     /*!< 2.75ms-4cycles */
    } CEC_CycleMax;
#define IS_CEC_CYCLE_MAX(param)    (((param) == CEC_CYCLE_MAX_0) || \
                                    ((param) == CEC_CYCLE_MAX_1) || \
                                    ((param) == CEC_CYCLE_MAX_2) || \
                                    ((param) == CEC_CYCLE_MAX_3) || \
                                    ((param) == CEC_CYCLE_MAX_4) || \
                                    ((param) == CEC_CYCLE_MAX_5) || \
                                    ((param) == CEC_CYCLE_MAX_6) || \
                                    ((param) == CEC_CYCLE_MAX_7))

    typedef enum {
        CEC_VALID_TIME_0 = 0,   /*!< 1.05ms */
        CEC_VALID_TIME_1 = 1,   /*!< 1.05ms+2cycles */
        CEC_VALID_TIME_2 = 2,   /*!< 1.05ms+4cycles */
        CEC_VALID_TIME_3 = 3,   /*!< 1.05ms+6cycles */
        CEC_VALID_TIME_4 = 4,   /*!< 1.05ms-2cycles */
        CEC_VALID_TIME_5 = 5,   /*!< 1.05ms-4cycles */
        CEC_VALID_TIME_6 = 6    /*!< 1.05ms-6cycles */
    } CEC_ValidTime;
#define IS_CEC_DATA_VALID_TIME(param)    (((param) == CEC_VALID_TIME_0) ||\
                                          ((param) == CEC_VALID_TIME_1) ||\
                                          ((param) == CEC_VALID_TIME_2) ||\
                                          ((param) == CEC_VALID_TIME_3) ||\
                                          ((param) == CEC_VALID_TIME_4) ||\
                                          ((param) == CEC_VALID_TIME_5) ||\
                                          ((param) == CEC_VALID_TIME_6))

    typedef enum {
        CEC_TIME_OUT_1_BIT = 0, /*!< 1 bit cycle */
        CEC_TIME_OUT_2_BIT = 1, /*!< 2 bit cycle */
        CEC_TIME_OUT_3_BIT = 2  /*!< 3 bit cycle */
    } CEC_TimeOut;
#define IS_CEC_TIME_OUT(param)    (((param) == CEC_TIME_OUT_1_BIT) ||\
                                   ((param) == CEC_TIME_OUT_2_BIT) ||\
                                   ((param) == CEC_TIME_OUT_3_BIT))

    typedef enum {
        CEC_LOGICAL_1_RISING_TIME_MIN_0 = 0,    /*!< 0.4ms */
        CEC_LOGICAL_1_RISING_TIME_MIN_1 = 1,    /*!< 0.4ms-1cycle */
        CEC_LOGICAL_1_RISING_TIME_MIN_2 = 2,    /*!< 0.4ms-2cycles */
        CEC_LOGICAL_1_RISING_TIME_MIN_3 = 3,    /*!< 0.4ms-3cycles */
        CEC_LOGICAL_1_RISING_TIME_MIN_4 = 4,    /*!< 0.4ms-4cycles */
        CEC_LOGICAL_1_RISING_TIME_MIN_5 = 5,    /*!< 0.4ms-5cycles */
        CEC_LOGICAL_1_RISING_TIME_MIN_6 = 6,    /*!< 0.4ms-6cycles */
        CEC_LOGICAL_1_RISING_TIME_MIN_7 = 7     /*!< 0.4ms-7cycles */
    } CEC_Logical1RisingTimeMin;
#define IS_LOGICAL_1_RISING_TIME_MIN(param)    (((param) == CEC_LOGICAL_1_RISING_TIME_MIN_0) || \
                                                ((param) == CEC_LOGICAL_1_RISING_TIME_MIN_1) || \
                                                ((param) == CEC_LOGICAL_1_RISING_TIME_MIN_2) || \
                                                ((param) == CEC_LOGICAL_1_RISING_TIME_MIN_3) || \
                                                ((param) == CEC_LOGICAL_1_RISING_TIME_MIN_4) || \
                                                ((param) == CEC_LOGICAL_1_RISING_TIME_MIN_5) || \
                                                ((param) == CEC_LOGICAL_1_RISING_TIME_MIN_6) || \
                                                ((param) == CEC_LOGICAL_1_RISING_TIME_MIN_7 ))

    typedef enum {
        CEC_LOGICAL_1_RISING_TIME_MAX_0 = 0,    /*!< 0.8ms */
        CEC_LOGICAL_1_RISING_TIME_MAX_1 = 1,    /*!< 0.8ms+1cycle */
        CEC_LOGICAL_1_RISING_TIME_MAX_2 = 2,    /*!< 0.8ms+2cycles */
        CEC_LOGICAL_1_RISING_TIME_MAX_3 = 3,    /*!< 0.8ms+3cycles */
        CEC_LOGICAL_1_RISING_TIME_MAX_4 = 4,    /*!< 0.8ms+4cycles */
        CEC_LOGICAL_1_RISING_TIME_MAX_5 = 5,    /*!< 0.8ms+5cycles */
        CEC_LOGICAL_1_RISING_TIME_MAX_6 = 6,    /*!< 0.8ms+6cycles */
        CEC_LOGICAL_1_RISING_TIME_MAX_7 = 7     /*!< 0.8ms+7cycles */
    } CEC_Logical1RisingTimeMax;
#define IS_LOGICAL_1_RISING_TIME_MAX(param)    (((param) == CEC_LOGICAL_1_RISING_TIME_MAX_0) || \
                                                ((param) == CEC_LOGICAL_1_RISING_TIME_MAX_1) || \
                                                ((param) == CEC_LOGICAL_1_RISING_TIME_MAX_2) || \
                                                ((param) == CEC_LOGICAL_1_RISING_TIME_MAX_3) || \
                                                ((param) == CEC_LOGICAL_1_RISING_TIME_MAX_4) || \
                                                ((param) == CEC_LOGICAL_1_RISING_TIME_MAX_5) || \
                                                ((param) == CEC_LOGICAL_1_RISING_TIME_MAX_6) || \
                                                ((param) == CEC_LOGICAL_1_RISING_TIME_MAX_7 ))

    typedef enum {
        CEC_LOGICAL_0_RISING_TIME_MIN_0 = 0,    /*!< 1.3ms */
        CEC_LOGICAL_0_RISING_TIME_MIN_1 = 1,    /*!< 1.3ms-1cycle */
        CEC_LOGICAL_0_RISING_TIME_MIN_2 = 2,    /*!< 1.3ms-2cycles */
        CEC_LOGICAL_0_RISING_TIME_MIN_3 = 3,    /*!< 1.3ms-3cycles */
        CEC_LOGICAL_0_RISING_TIME_MIN_4 = 4,    /*!< 1.3ms-4cycles */
        CEC_LOGICAL_0_RISING_TIME_MIN_5 = 5,    /*!< 1.3ms-5cycles */
        CEC_LOGICAL_0_RISING_TIME_MIN_6 = 6,    /*!< 1.3ms-6cycles */
        CEC_LOGICAL_0_RISING_TIME_MIN_7 = 7     /*!< 1.3ms-7cycles */
    } CEC_Logical0RisingTimeMin;
#define IS_LOGICAL_0_RISING_TIME_MIN(param)    (((param) == CEC_LOGICAL_0_RISING_TIME_MIN_0) || \
                                                ((param) == CEC_LOGICAL_0_RISING_TIME_MIN_1) || \
                                                ((param) == CEC_LOGICAL_0_RISING_TIME_MIN_2) || \
                                                ((param) == CEC_LOGICAL_0_RISING_TIME_MIN_3) || \
                                                ((param) == CEC_LOGICAL_0_RISING_TIME_MIN_4) || \
                                                ((param) == CEC_LOGICAL_0_RISING_TIME_MIN_5) || \
                                                ((param) == CEC_LOGICAL_0_RISING_TIME_MIN_6) || \
                                                ((param) == CEC_LOGICAL_0_RISING_TIME_MIN_7 ))

