coocox/Mplib/Toshaba/TMPM33x/TMPM330/cmsis_lib/lib/include/tmpm330_cec.h
    typedef enum {
        CEC_LOGICAL_0_RISING_TIME_MAX_0 = 0,    /*!< 1.7ms */
        CEC_LOGICAL_0_RISING_TIME_MAX_1 = 1,    /*!< 1.7ms+1cycle */
        CEC_LOGICAL_0_RISING_TIME_MAX_2 = 2,    /*!< 1.7ms+2cycles */
        CEC_LOGICAL_0_RISING_TIME_MAX_3 = 3,    /*!< 1.7ms+3cycles */
        CEC_LOGICAL_0_RISING_TIME_MAX_4 = 4,    /*!< 1.7ms+4cycles */
        CEC_LOGICAL_0_RISING_TIME_MAX_5 = 5,    /*!< 1.7ms+5cycles */
        CEC_LOGICAL_0_RISING_TIME_MAX_6 = 6,    /*!< 1.7ms+6cycles */
        CEC_LOGICAL_0_RISING_TIME_MAX_7 = 7     /*!< 1.7ms+7cycles */
    } CEC_Logical0RisingTimeMax;
#define IS_LOGICAL_0_RISING_TIME_MAX(param)    (((param) == CEC_LOGICAL_0_RISING_TIME_MAX_0) || \
                                                ((param) == CEC_LOGICAL_0_RISING_TIME_MAX_1) || \
                                                ((param) == CEC_LOGICAL_0_RISING_TIME_MAX_2) || \
                                                ((param) == CEC_LOGICAL_0_RISING_TIME_MAX_3) || \
                                                ((param) == CEC_LOGICAL_0_RISING_TIME_MAX_4) || \
                                                ((param) == CEC_LOGICAL_0_RISING_TIME_MAX_5) || \
                                                ((param) == CEC_LOGICAL_0_RISING_TIME_MAX_6) || \
                                                ((param) == CEC_LOGICAL_0_RISING_TIME_MAX_7 ))

    typedef enum {
        CEC_START_BIT_RISING_TIME_MIN_0 = 0,    /*!< 3.5ms */
        CEC_START_BIT_RISING_TIME_MIN_1 = 1,    /*!< 3.5ms-1cycle */
        CEC_START_BIT_RISING_TIME_MIN_2 = 2,    /*!< 3.5ms-2cycles */
        CEC_START_BIT_RISING_TIME_MIN_3 = 3,    /*!< 3.5ms-3cycles */
        CEC_START_BIT_RISING_TIME_MIN_4 = 4,    /*!< 3.5ms-4cycles */
        CEC_START_BIT_RISING_TIME_MIN_5 = 5,    /*!< 3.5ms-5cycles */
        CEC_START_BIT_RISING_TIME_MIN_6 = 6,    /*!< 3.5ms-6cycles */
        CEC_START_BIT_RISING_TIME_MIN_7 = 7     /*!< 3.5ms-7cycles */
    } CEC_StartBitRisingTimeMin;
#define IS_CEC_START_BIT_RISING_TIME_MIN(param)    (((param) == CEC_START_BIT_RISING_TIME_MIN_0) || \
                                                    ((param) == CEC_START_BIT_RISING_TIME_MIN_1) || \
                                                    ((param) == CEC_START_BIT_RISING_TIME_MIN_2) || \
                                                    ((param) == CEC_START_BIT_RISING_TIME_MIN_3) || \
                                                    ((param) == CEC_START_BIT_RISING_TIME_MIN_4) || \
                                                    ((param) == CEC_START_BIT_RISING_TIME_MIN_5) || \
                                                    ((param) == CEC_START_BIT_RISING_TIME_MIN_6) || \
                                                    ((param) == CEC_START_BIT_RISING_TIME_MIN_7 ))

    typedef enum {
        CEC_START_BIT_RISING_TIME_MAX_0 = 0,    /*!< 3.9ms */
        CEC_START_BIT_RISING_TIME_MAX_1 = 1,    /*!< 3.9ms+1cycle */
        CEC_START_BIT_RISING_TIME_MAX_2 = 2,    /*!< 3.9ms+2cycles */
        CEC_START_BIT_RISING_TIME_MAX_3 = 3,    /*!< 3.9ms+3cycles */
        CEC_START_BIT_RISING_TIME_MAX_4 = 4,    /*!< 3.9ms+4cycles */
        CEC_START_BIT_RISING_TIME_MAX_5 = 5,    /*!< 3.9ms+5cycles */
        CEC_START_BIT_RISING_TIME_MAX_6 = 6,    /*!< 3.9ms+6cycles */
        CEC_START_BIT_RISING_TIME_MAX_7 = 7     /*!< 3.9ms+7cycles */
    } CEC_StartBitRisingTimeMax;
#define IS_CEC_START_BIT_RISING_TIME_MAX(param)    (((param) == CEC_START_BIT_RISING_TIME_MAX_0) || \
                                                    ((param) == CEC_START_BIT_RISING_TIME_MAX_1) || \
                                                    ((param) == CEC_START_BIT_RISING_TIME_MAX_2) || \
                                                    ((param) == CEC_START_BIT_RISING_TIME_MAX_3) || \
                                                    ((param) == CEC_START_BIT_RISING_TIME_MAX_4) || \
                                                    ((param) == CEC_START_BIT_RISING_TIME_MAX_5) || \
                                                    ((param) == CEC_START_BIT_RISING_TIME_MAX_6) || \
                                                    ((param) == CEC_START_BIT_RISING_TIME_MAX_7 ))

    typedef enum {
        CEC_START_BIT_CYCLE_MIN_0 = 0,  /*!< 4.3ms */
        CEC_START_BIT_CYCLE_MIN_1 = 1,  /*!< 4.3ms-1cycle */
        CEC_START_BIT_CYCLE_MIN_2 = 2,  /*!< 4.3ms-2cycles */
        CEC_START_BIT_CYCLE_MIN_3 = 3,  /*!< 4.3ms-3cycles */
        CEC_START_BIT_CYCLE_MIN_4 = 4,  /*!< 4.3ms-4cycles */
        CEC_START_BIT_CYCLE_MIN_5 = 5,  /*!< 4.3ms-5cycles */
        CEC_START_BIT_CYCLE_MIN_6 = 6,  /*!< 4.3ms-6cycles */
        CEC_START_BIT_CYCLE_MIN_7 = 7   /*!< 4.3ms-7cycles */
    } CEC_StartBitCycleMin;
#define IS_CEC_START_BIT_CYCLE_MIN(param)    (((param) == CEC_START_BIT_CYCLE_MIN_0) || \
                                              ((param) == CEC_START_BIT_CYCLE_MIN_1) || \
                                              ((param) == CEC_START_BIT_CYCLE_MIN_2) || \
                                              ((param) == CEC_START_BIT_CYCLE_MIN_3) || \
                                              ((param) == CEC_START_BIT_CYCLE_MIN_4) || \
                                              ((param) == CEC_START_BIT_CYCLE_MIN_5) || \
                                              ((param) == CEC_START_BIT_CYCLE_MIN_6) || \
                                              ((param) == CEC_START_BIT_CYCLE_MIN_7 ))

    typedef enum {
        CEC_START_BIT_CYCLE_MAX_0 = 0,  /*!< 4.7ms */
        CEC_START_BIT_CYCLE_MAX_1 = 1,  /*!< 4.7ms+1cycle */
        CEC_START_BIT_CYCLE_MAX_2 = 2,  /*!< 4.7ms+2cycles */
        CEC_START_BIT_CYCLE_MAX_3 = 3,  /*!< 4.7ms+3cycles */
        CEC_START_BIT_CYCLE_MAX_4 = 4,  /*!< 4.7ms+4cycles */
        CEC_START_BIT_CYCLE_MAX_5 = 5,  /*!< 4.7ms+5cycles */
        CEC_START_BIT_CYCLE_MAX_6 = 6,  /*!< 4.7ms+6cycles */
        CEC_START_BIT_CYCLE_MAX_7 = 7   /*!< 4.7ms+7cycles */
    } CEC_StartBitCycleMax;
#define IS_CEC_START_BIT_CYCLE_MAX(param)    (((param) == CEC_START_BIT_CYCLE_MAX_0) || \
                                              ((param) == CEC_START_BIT_CYCLE_MAX_1) || \
                                              ((param) == CEC_START_BIT_CYCLE_MAX_2) || \
                                              ((param) == CEC_START_BIT_CYCLE_MAX_3) || \
                                              ((param) == CEC_START_BIT_CYCLE_MAX_4) || \
                                              ((param) == CEC_START_BIT_CYCLE_MAX_5) || \
                                              ((param) == CEC_START_BIT_CYCLE_MAX_6) || \
                                              ((param) == CEC_START_BIT_CYCLE_MAX_7 ))

